ryousato/LPC11U35_CTswitch_relay/main.cpp
////////////////////////////////////////////////// 
// Include Files
#include "mbed.h"
#include "LPC11Uxx.h"
#include "USBSerial.h"
//////////////////////////////////////////////////

//Configure the PC Serial Port for CDC USB
USBSerial serial;
Serial device(P0_19,P0_18);
Ticker OffsetCal; 
Ticker timerint;
Timer timecount;

//Pin Defines
DigitalOut led1(LED1);

char moji[32];  //入力文字列
int suuji[6];
int count = 0;  //文字数カウンタ
int CorF;
int adjmode;
int val;        //POTのワイパー移動数
int incr;
int wa;
    int mode_p = 0;
    int *pmode;
    int CTrange;        //[60A:120A] [0:1]
    int *pCTrange;
float Vcc = 3.292; //実測値を入力すること
float Vref;
    float ActualVref[4] = {1.65, 1.65, 1.65, 1.65};
    float *pAVrefcal;
int AD_flag;
float AD_val = 0;
float AD_val_sum = 0;
float Vrms = 0;
float set_val = 0;
float diff = 0;
//float zero_cal[2];
int AD_count = 0;
float setval = 0;


DigitalOut coilEN1(P0_1);
DigitalOut coilEN2(P0_2);
DigitalOut coilEN3(P0_3);
DigitalOut coilEN4(P0_4);
DigitalOut coilEN5(P0_5);
DigitalOut coilEN6(P0_20);
DigitalOut coilEN7(P1_19);

DigitalOut ENn(P0_16);
DigitalOut addr0(P0_17);
DigitalOut addr1(P0_18);
DigitalOut addr2(P0_19);

DigitalOut SCT_AMP(P0_10);
DigitalOut WLATn(P0_23);
DigitalOut SHDNn(P1_15);

AnalogIn AD_TRANS_IN(P0_11);    //AD_TRANS_IN
AnalogIn AD_CT_IN(P0_12);       //AD_CT_IN


SPI spi(P0_9, P0_8, P0_6);

void setup() {
    spi.format(16,0);
    wait(0.02);
    spi.frequency(1000000);  
    device.baud(115200);

    coilEN1 = 0;    //50Hz
    coilEN2 = 0;    //TRANS_OUT調整
    coilEN3 = 0;    //CT1,2_OUT調整
    coilEN4 = 0;    //CT1,2_OUT選択
    coilEN5 = 0;    //±5V,±15 OFF
    coilEN6 = 0;    //未使用
    coilEN7 = 0;    //未使用

    ENn = 1;        //CD74HC4051E CSをディセーブル
    addr0 = 0;
    addr1 = 0;
    addr2 = 0;

    WLATn = 1;      //MCP41HV51-503EST ワイパーラッチ
    SCT_AMP = 0;    //CT入力アンプ 60Aレベル切替え
    CTrange = 0;
    SHDNn = 1;      //電流帰還アンプ シャットダウンしない
}

void serialstart(){
    wait(0.02);
    serial.printf("\r\nReady!\r\n");
    wait(0.02);
}

void helpwrite(){
    serial.printf("\r\n------------------");
    //serial.printf("\r\ncmd");             
    serial.printf("\r\nhelp");            
    //serial.printf("\r\n?");               
    serial.printf("\r\ninitial");         
    serial.printf("\r\nV_OFF");           
    serial.printf("\r\nV_ON");            
    serial.printf("\r\n50Hz");            
    serial.printf("\r\n60Hz");            
    serial.printf("\r\nTRANS_OUT_ADINT");  
    serial.printf("\r\nCT1_OUT_ADINT");
    serial.printf("\r\nCT2_OUT_ADINT");
    serial.printf("\r\nTRANS_OUT_EXT");    
    serial.printf("\r\nCT_OUT_EXT");
    serial.printf("\r\nCTrange_60A");
    serial.printf("\r\nCTrange_120A");
    serial.printf("\r\nTRANS_offset");
    serial.printf("\r\nCT_offset");
//    serial.printf("\r\nCT2_offset");
    serial.printf("\r\ndispVref");  
    serial.printf("\r\nTRANS_ADJ_100V");
    serial.printf("\r\nCT1_ADJ_60A");
    serial.printf("\r\nCT2_ADJ_60A");
    serial.printf("\r\nTRANS_ADJ_MODE");       
    serial.printf("\r\nCT1_ADJ_MODE");         
    serial.printf("\r\nCT2_ADJ_MODE");         
    serial.printf("\r\nMANUAL_TRANS_ADJ");
    serial.printf("\r\nMANUAL_CT1_ADJ");  
    serial.printf("\r\nMANUAL_CT2_ADJ");  
    serial.printf("\r\n------------------");
}

//MCP41HV51コマンド
//デバッグ用
void TCON(){                                       //端子スイッチ接続
        int whoami = spi.write(0x40FF); 
        serial.printf("\r\nWHOAMI register = 0x%X", whoami);
}

//デバッグ用
void TCONread(){
        int whoami = spi.write(0x4C00);
        serial.printf("\r\nWHOAMI register = 0x%X", whoami);
}

//デバッグ用
void read(){
        int read_val = spi.write(0x0C00);
        serial.printf("\r\nread_val = 0x%X", read_val);
}

//デバッグ用
void write00(){
        int whoami = spi.write(0x0000);
        serial.printf("\r\nWHOAMI register = 0x%X", whoami);
}

//デバッグ用
void write7F(){
        int whoami = spi.write(0x007F);
        serial.printf("\r\nWHOAMI register = 0x%X", whoami);
}

//デバッグ用
void writeFF(){
        int whoami = spi.write(0x00FF);
        serial.printf("\r\nWHOAMI register = 0x%X", whoami);
}

//デバッグ用
void TENinc(){
        int readval = spi.write(0x0C00);
        int incval = readval & 0xFF;
        incval = incval + 10;
        int whoami = spi.write(incval);
        serial.printf("\r\nWHOAMI register = 0x%X", whoami);
}

void WLAT(){
        WLATn = 0;
        wait(0.02);
        WLATn = 1;
        //serial.printf("\r\n OK(WLAT)");
}

//CD74HC4051Eのイネーブル
void CS(int cs){
        ENn = cs;
        serial.printf("\r\n OK(CS)");
}

/******************************************************************************/
//CD74HC4051Eのアドレスセレクト
/******************************************************************************/
void ADDR(int addr){
        ENn = 1;        //CSをディセーブルにしておく
        wait(0.02);
        if(addr == 0){
            addr0 = 0;
            addr1 = 0;
            addr2 = 0;
            }
        else if(addr == 1){
            addr0 = 0;
            addr1 = 1;
            addr2 = 0;
            }
        else if(addr == 2){
            addr0 = 1;
            addr1 = 0;
            addr2 = 0;
            }
        else if(addr == 3){
            addr0 = 1;
            addr1 = 1;
            addr2 = 0;
            }
        else if(addr == 4){
            addr0 = 0;
            addr1 = 0;
            addr2 = 1;
            }
        else if(addr == 5){
            addr0 = 1;
            addr1 = 0;
            addr2 = 1;
            }
        else if(addr == 6){
            addr0 = 0;
            addr1 = 1;
            addr2 = 1;
            }
        else if(addr == 7){
            addr0 = 1;
            addr1 = 1;
            addr2 = 1;
            }
        wait(0.02);
        ENn = 0;        //イネーブル
        wait(0.02);
        //serial.printf("\r\n OK(ADDR%d)", addr);
}

/******************************************************************************/
//POT制御
//指定したPOTの現在値から、指定した量を増減する
/******************************************************************************/
void incdec(int incr, int val, int CorF, int mode){       //incr [0:1][-:+], val [0~255], CorF [2:1][C:F], mode [1:2:3][trans:ct1:ct2]
    //現在の設定値読み取り
    ADDR(mode * 2 + CorF -2);
    int read_val = spi.write(0x0C00);
    read_val &= 0x00FF;
    
    //現在の設定値から増減値書き込み
    int write_val;
    if(incr == 1){write_val = read_val + val;}
    else if(incr == 0){write_val = read_val - val;}
    spi.write(write_val);
    
    wait(0.001);
    
    //粗、微　読み取り
    ADDR(mode * 2);             //TRANS粗調整POT
    int read_val_Coarse = spi.write(0x0C00);
    read_val_Coarse &= 0x00FF;
    
    wait(0.001);
    
    ADDR(mode * 2 - 1);         //TRANS微調整POT
    int read_val_Fine = spi.write(0x0C00);
    read_val_Fine &= 0x00FF;
    
    WLAT();
    
    wait(0.001);
    
