ryousato/LPC11U35_CTswitch_relay/main.cpp
    ENn = 1;    //ディセーブル

    serial.printf("\r\n Status  --- Coarse[%d/255], Fine[%d/255] ---", read_val_Coarse, read_val_Fine);
}

/******************************************************************************/
//AD変換
//デバッグ用
/******************************************************************************/

void AD(int ad){
        unsigned short AD_Val;
        float AD_Val_f;
        if(ad == 1){
            AD_Val = (AD_TRANS_IN.read_u16() >> 6); //右シフト「>> 6」で10bit分解能に合わせる
            AD_Val_f = AD_TRANS_IN.read();
            }
        else if(ad == 2){
            AD_Val = (AD_CT_IN.read_u16() >> 6); //右シフト「>> 6」で10bit分解能に合わせる
            AD_Val_f = AD_CT_IN.read();
            }
        wait(0.02);
        serial.printf("\r\nAD_Val   : %1f [V] / (%d)d / (%x)h",(AD_Val*Vcc/1023),AD_Val,AD_Val);
        serial.printf("\r\nAD_Val_f : %1f [V] / (%f)d",(AD_Val_f*Vcc),AD_Val_f);
}


   
void AD_CT(){
        float AD_Val;
        AD_Val = AD_TRANS_IN.read();
        wait(0.02);
        serial.printf("\r\n%1.3f",AD_Val);
    }

/******************************************************************************/
//各POT初期設定
//mode 1:TRANS 2:CT1 3:CT2
/******************************************************************************/
void POTini(int mode){
    ADDR(mode * 2);             //TRANS粗調整POT
    if(mode==1){spi.write(0x0076);}
    else if(mode==2 || mode==3){spi.write(0x006B);}
    
    wait(0.001);
    
    ADDR(mode * 2 - 1);         //TRANS微調整POT
    spi.write(0x007F);
    
    WLAT();
    
    wait(0.001);
    
    ENn = 1;    //ディセーブル
}

/******************************************************************************/
//初期設定
//TRANS_OUT,CT1,2_OUTを初期値(50Hz,AC100V,60A相当)に調整
/******************************************************************************/
void initial(){
    //全てのPOTの端子スイッチをONにする(TCON)
    ADDR(1);    //TRANS微調整POT
    spi.write(0x40FF);
    ADDR(2);    //TRANS粗調整POT
    spi.write(0x40FF);
    ADDR(3);    //CT1微調整POT
    spi.write(0x40FF);
    ADDR(4);    //CT1粗調整POT
    spi.write(0x40FF);
    ADDR(5);    //CT2微調整POT
    spi.write(0x40FF);
    ADDR(6);    //CT2粗調整POT
    spi.write(0x40FF);
    wait(0.02);
    ENn = 1;        //CSをディセーブル
    
    coilEN5 = 1;    //±5V,±15VをON
    
    coilEN1 = 0;    //50Hz切替え
    
    SCT_AMP = 0;    //CT入力アンプ 60Aレベル切替え
    CTrange = 0;
    SHDNn = 1;      //電流帰還アンプ シャットダウンしない
    
    //TRANS_OUT初期設定
    coilEN2 = 0;    //TRANS_OUTをAD入力方向へ切替え
    
    ADDR(2);        //TRANS粗調整POT
    spi.write(0x0076);
    //read();
    ADDR(1);        //TRANS微調整POT
    spi.write(0x007F);
    //read();
    WLAT();         //設定したワイパーをラッチ
    wait(0.02);
    ENn = 1;        //CSをディセーブル

    //CT1_OUT初期設定
    coilEN3 = 0;    //CT1_OUT1と2をAD入力方向へ切替え
    coilEN4 = 0;    //CT1を選択
    
    ADDR(4);        //CT1粗調整POT
    spi.write(0x006B);
    //read();
    ADDR(3);        //CT1微調整POT
    spi.write(0x007F);
    //read();
    WLAT();         //設定したワイパーをラッチ
    wait(0.02);
    ENn = 1;        //CSをディセーブル

    //CT2_OUT初期設定
    coilEN3 = 0;    //CT1_OUT1と2をAD入力方向へ切替え
    coilEN4 = 1;    //CT2を選択
    
    POTini(3);
    ADDR(6);        //CT2粗調整POT
    spi.write(0x006B);
    //read();
    ADDR(5);        //CT2微調整POT
    spi.write(0x007F);
    //read();
    WLAT();         //設定したワイパーをラッチ
    wait(0.02);
    ENn = 1;        //CSをディセーブル
    
    coilEN2 = 1;    //TRANS_OUT出力
    coilEN3 = 1;    //CT1,2_OUT出力
    coilEN4 = 0;

/* 
    for(int i=0; i<10*2; i++){
        led1 = !led1;
        wait(0.1);
        }
    led1 = 0;
*/
    serial.printf("\r\n OK(initial)");
}

/******************************************************************************/
//手動調整
/******************************************************************************/
void manual_adj(int mode){
    if(mode == 2 || mode == 3){
        serial.printf("\r\n Select range mode. Type '60A' or '120A'.");
        while(1){
            if(serial.readable()) {    // 受信確認
                moji[count] = serial.getc();        //キーボード入力文字を1文字ずつmojiに代入
                serial.printf("%c", moji[count]);   //シリアル出力表示
    
                if(count == 5 ){                // ①文字数が既定の個数になった場合
                    moji[5] = '\0';                 // 末尾に終端文字を入れる
                    serial.printf("\r\n\r\n ERROR!\r\n");
                    count = 0;                       // 文字カウンタをリセット
                    }

                else if(moji[0] == '\n'){count = 0;}
    
                else if((moji[count] == '\r')) {       // ②CRを受信した場合
                    moji[count] = '\0';                                         //末尾に終端文字を入れる
                    count = 0;                                                  //文字カウンタをリセット
                    if     (strcmp(moji, "60A") == 0){
                        SCT_AMP = 0;        //CT入力アンプ 60Aレベル切替え
                        CTrange = 0;
                        break;}
                    else if(strcmp(moji, "120A") == 0){
                        SCT_AMP = 1;        //CT入力アンプ 120Aレベル切替え
                        CTrange = 1;
                        break;}
                    else serial.printf("\r\n\r\n NG!\r\n");
                    }
                else count++;        // 文字カウンタに1加算
            }
        }
        serial.printf("\r\n OK");
    }

/*
    if(mode == 1){coilEN2 = 0;}                     //TRANS_OUTをAD入力方向へ切替え
    else if(mode == 2){coilEN3 = 0; coilEN4 = 0;}   //CT1_OUT1と2をAD入力方向へ切替え
    else if(mode == 3){coilEN3 = 0; coilEN4 = 1;}   //CT1_OUT1と2をAD入力方向へ切替え
*/

        //POTの状態を確認し、ステータス情報に表示する
        ADDR(mode * 2);             //TRANS粗調整POT
        wait(0.2);
        int read_val_Coarse = spi.write(0x0C00);
        read_val_Coarse &= 0x00FF;
        
        ADDR(mode * 2 - 1);         //TRANS微調整POT
        wait(0.2);
        int read_val_Fine = spi.write(0x0C00);
        read_val_Fine &= 0x00FF;
        ENn = 1;                    //CSをディセーブル
        serial.printf("\r\n\r\n Status  --- Coarse[%d/255], Fine[%d/255] ---\r\n", read_val_Coarse, read_val_Fine);

        
        //ループスタート
        while(1){   //ループ1
                serial.printf("\r\n Select mode '+-' or 'num'. ('q' quit)\r\n");
                while(1){ //adjmode
                    if(serial.readable()) {    // 受信確認
                        moji[count] = serial.getc();        //キーボード入力文字を1文字ずつmojiに代入
                        serial.printf("%c", moji[count]);   //シリアル出力表示
    
                        if(count == 4 ){                // ①文字数が既定の個数になった場合
                            moji[4] = '\0';                 // 末尾に終端文字を入れる
                            serial.printf("\r\n\r\n ERROR!\r\n");
                            count = 0;                       // 文字カウンタをリセット
                        }

                        else if(moji[0] == '\n'){count = 0;}
    
                        else if((moji[count] == '\r')) {       // ②CRを受信した場合
                            moji[count] = '\0';                                         //末尾に終端文字を入れる
                            count = 0;                                                  //文字カウンタをリセット
                            if     (strcmp(moji,"+-") == 0){
                                adjmode = 1;
                                break;}
                            else if(strcmp(moji,"num") == 0){
                                adjmode = 2;
                                break;}
                            else if(strcmp(moji,"q") == 0){break;}
                            else serial.printf("\r\n\r\n NG!\r\n");
                        }
                        else count++;        // 文字カウンタに1加算
                    }
                } //adjmode
            
                if(strcmp(moji,"q")==0){serial.printf("\r\n quit\r\n"); break;} //ループ1ブレイク

