ryousato/LPC11U35_CTswitch_relay/main.cpp
//デバッグ用
void att(int mode){
    mode_p = mode;
    //timerint.attach(&timerAD,0.020408);    //サンプリング数=49  20.4ms周期
    timerint.attach(&timerAD,0.008);
    } 
void det(){timerint.detach();}

/******************************************************************************/
//自動調整(コマンド)
//TRANS_OUT設定範囲 : AC 50~138V
//CT1,2_OUT設定範囲 : AC 10~120A
/******************************************************************************/
void auto_adj(int mode, float setval){
    
    int adjnum = 0; //コマンド判定フラグ
    
    //設定範囲判定 と Vrms換算
    if(mode == 1) {
        if(setval >= 50 && setval <= 138) {
            setval = setval * 0.12 * 0.196078;  //0.12:トランス比 0.196078:分圧抵抗比
            //serial.printf("\r\n %f",setval);
            setval /= 2;
            setval /= sqrtf(2);
            serial.printf("\r\n setval = %f",setval);
        } else {
            serial.printf("\r\n\r\n NG!\r\n");
            adjnum = 1;
        }
    } else if(mode==2 || mode==3) {
        if(setval >= 10 && setval <= 120) {
            if(setval >= 61 && setval <= 120) {
                SCT_AMP = 1;
                CTrange = 1;
            }
            if(CTrange == 0) {
                setval = setval / 3000 * 10 * 5.666667;  //3000:CT比 10:終端抵抗 5.666667:分圧抵抗比
            } else if(CTrange == 1) {
                setval = setval / 3000 * 10 * 2.833333;  //3000:CT比 10:終端抵抗 2.833333:分圧抵抗比
            }
            serial.printf("\r\n setval = %f",setval);
        } else {
            serial.printf("\r\n\r\n NG!\r\n");
            adjnum = 1;
        }
    } else {
        serial.printf("\r\n\r\n NG!\r\n");
        adjnum = 1;
    }

    int adjcount = 0; //ループ2上限変数

    while(1) { //ループ2
        if(adjnum == 1) {
            serial.printf("\r\n\r\n COMMAND ERROR!");
            break; //ループ2ブレイク
        } else if(adjcount >= 15) { //ループ2上限値
            serial.printf("\r\n\r\n ERROR!\r\n");
            break; //ループ2ブレイク
        }

        ADVrms(mode);   //現在のVrms値

        diff = setval - Vrms;   //差分
        //serial.printf("\r\n diff = %f",diff);

        //増減方向判定
        if(diff > 0) {
            incr = 1;   //増
        } else if(diff < 0) {
            incr = 0;           //減
            diff *= -1;         //絶対値
        } else if(diff == 0) {
            break;   //差分無し ループ2ブレイク
        }
        serial.printf("\r\n diff = %f",diff);
        serial.printf("\r\n incr = %d",incr);


        //粗、微　読み取り
        ADDR(mode * 2);             //TRANS粗調整POT
        int read_val_Coarse = spi.write(0x0C00);
        read_val_Coarse &= 0x00FF;

        wait(0.001);

        ADDR(mode * 2 - 1);         //TRANS微調整POT
        int read_val_Fine = spi.write(0x0C00);
        read_val_Fine &= 0x00FF;

        //serial.printf("\r\n read_val_Coarse = %d",read_val_Coarse);
        //serial.printf("\r\n read_val_Fine = %d",read_val_Fine);


        if(mode == 1) {
            //粗・微 調整判定
            float diffref_C = 0.000412 / 255 * read_val_Fine + 0.0032;
            float diffref_F = 0.000412 / 255 * read_val_Coarse + 0.000165;
            float diffcom = diffref_C * 1.5;
            //serial.printf("\r\n diffref_C = %f",diffref_C);
            //serial.printf("\r\n diffref_F = %f",diffref_F);
            //serial.printf("\r\n diffcom = %f",diffcom);
            if(diff >= diffcom) {
                CorF = 2;   //粗
            } else if(diff < diffcom) {
                CorF = 1;               //微
                if(diff < 0.001) {
                    break;   //差分微小 ループ2ブレイク(通常最終ゴール)
                }
            }
            serial.printf("\r\n CorF = %d",CorF);

            //調整tap値算出
            if(CorF == 2) {
                val = diff / diffref_C;
            } else if(CorF == 1) {
                val = diff / diffref_F;
            }
            serial.printf("\r\n tap(val) = %d",val);
        } else if(mode==2 || mode==3) {
            if(CTrange == 0) {  //60Aのとき
                //粗・微 調整判定
                float diffref_C = 0.001966 / 255 * read_val_Fine + 0.00885;
                float diffref_F = 0.001966 / 255 * read_val_Coarse + 0.0001;
                float diffcom = diffref_C * 1.5;
                //serial.printf("\r\n diffref_C = %f",diffref_C);
                //serial.printf("\r\n diffref_F = %f",diffref_F);
                //serial.printf("\r\n diffcom = %f",diffcom);
                if(diff >= diffcom) {
                    CorF = 2;   //粗
                } else if(diff < diffcom) {
                    CorF = 1;               //微
                    if(diff < 0.002) {
                        break;   //差分微小 ループ2ブレイク(通常最終ゴール)
                    }
                }
                serial.printf("\r\n CorF = %d",CorF);

                //調整tap値算出
                if(CorF == 2) {
                    val = diff / diffref_C;
                } else if(CorF == 1) {
                    val = diff / diffref_F;
                }
                serial.printf("\r\n tap(val) = %d",val);
            } else if(CTrange == 1) { //120Aのとき
                //粗・微 調整判定
                float diffref_C = 0.000983 / 255 * read_val_Fine + 0.0044;
                float diffref_F = 0.000983 / 255 * read_val_Coarse + 0.000049;
                float diffcom = diffref_C * 1.5;
                //serial.printf("\r\n diffref_C = %f",diffref_C);
                //serial.printf("\r\n diffref_F = %f",diffref_F);
                //serial.printf("\r\n diffcom = %f",diffcom);
                if(diff >= diffcom) {
                    CorF = 2;   //粗
                } else if(diff < diffcom) {
                    CorF = 1;               //微
                    if(diff < 0.002) {
                        break;   //差分微小 ループ2ブレイク(通常最終ゴール)
                    }
                }
                serial.printf("\r\n CorF = %d",CorF);

                //調整tap値算出
                if(CorF == 2) {
                    val = diff / diffref_C;
                } else if(CorF == 1) {
                    val = diff / diffref_F;
                }
                serial.printf("\r\n tap(val) = %d",val);
            }
        }
        //ワイパー位置移動
        incdec(incr, val, CorF, mode);

        adjcount ++;

    } //ループ2

    if(mode==1) {
        coilEN2 = 1;   //TRANS_OUTを外部出力へ切替え
    } else if(mode==2 || mode==3) {
        coilEN3 = 1;    //CT1_OUT1と2を外部出力へ切替え
        coilEN4 = 0;
    }

    serial.printf("\r\n ADJ END");
}

/******************************************************************************/
//自動調整(モード)
//TRANS_OUT設定範囲 : AC 50~138V
//CT1,2_OUT設定範囲 : AC 10~120A
/******************************************************************************/
void auto_adj_mode(int mode){    

///////////////////////////////////////////////////////////////////////////////
    POTini(mode);   //POTを初期値に設定
///////////////////////////////////////////////////////////////////////////////

    //'60A' or '120A'
    if(mode == 2 || mode == 3){
        serial.printf("\r\n Select range mode. Type '60A' or '120A'.");
        while(1){
            if(serial.readable()) {    // 受信確認
                moji[count] = serial.getc();        //キーボード入力文字を1文字ずつmojiに代入
                serial.printf("%c", moji[count]);   //シリアル出力表示
    
                if(count == 5 ){                // ①文字数が既定の個数になった場合
                    moji[5] = '\0';                 // 末尾に終端文字を入れる
                    serial.printf("\r\n\r\n ERROR!\r\n");
                    count = 0;                       // 文字カウンタをリセット
                    }

                else if(moji[0] == '\n'){count = 0;}
    
                else if((moji[count] == '\r')) {       // ②CRを受信した場合
                    moji[count] = '\0';                                         //末尾に終端文字を入れる
                    count = 0;                                                  //文字カウンタをリセット
                    if     (strcmp(moji, "60A") == 0){
                        SCT_AMP = 0;        //CT入力アンプ 60Aレベル切替え
                        CTrange = 0;
                        break;}
                    else if(strcmp(moji, "120A") == 0){
                        SCT_AMP = 1;        //CT入力アンプ 120Aレベル切替え
                        CTrange = 1;
                        break;}
                    else serial.printf("\r\n\r\n NG!\r\n");
                    }
                else count++;        // 文字カウンタに1加算
            }
        }
        serial.printf("\r\n OK");
    } //'60A' or '120A'

