ryousato/LPC11U35_CTswitch_relay/main.cpp
    while(1) { //ループ1
        int adjnum = 0;
    
        //シリアル表示
        if(mode == 1) {
            serial.printf("\r\n Type number AC [50-138] V. ('q' quit)");
        } else if(mode==2 || mode==3) {
            serial.printf("\r\n Type number AC [10-120] A. ('q' quit)\r\n (If 61~120A, range mode change 120A automatically.)");
        }

        for(int i=0; i<3; i++) {
            moji[i] = '0';   //mojiを初期化
        }

        while(1) { //adjnumループ
            if(serial.readable()) {    // 受信確認
                moji[count] = serial.getc();        //キーボード入力文字を1文字ずつmojiに代入
                serial.printf("%c", moji[count]);   //シリアル出力表示

                if(count == 4 ) {               // ①文字数が既定の個数になった場合
                    moji[4] = '\0';                 // 末尾に終端文字を入れる
                    serial.printf("\r\n\r\n ERROR!\r\n");
                    count = 0;                       // 文字カウンタをリセット
                } else if(moji[0] == '\n') {
                    count = 0;
                } else if((moji[count] == '\r')) {     // ②CRを受信した場合
                    moji[count] = '\0';                                         //末尾に終端文字を入れる
                    count = 0;                                                  //文字カウンタをリセット
                    if(strcmp(moji,"q")==0) {
                        break;
                    }
                    for(int i=0; i<3; i++) {
                        suuji[i] = 0;   //suujiを初期化
                    }
                    for(int i=0; i<3; i++) {
                        suuji[i] = moji[i];
                        suuji[i] -= 48;  //ASCII → 10進
                    }
                    for(int i=0; i<3; i++) {
                        moji[i] = '0';   //mojiを初期化
                    }

                    //数字であるか判定
                    if(suuji[0]>=0 && suuji[0]<=9) {
                        if(suuji[1]>=0&&suuji[1]<=9) {
                            if(suuji[2]>=0&&suuji[2]<=9) {
                                suuji[0] *= 100;
                                suuji[1] *= 10;
                            } else {
                                suuji[0] *= 10;
                                suuji[2] = 0;
                            }
                        } else {
                            suuji[1] = 0;
                            suuji[2] = 0;
                        }
                    } else {
                        serial.printf("\r\n\r\n NG!\r\n");
                        adjnum = 1;
                        break;  //adjnumループ ブレイク
                    }

                    setval = suuji[0]+suuji[1]+suuji[2];
                    
                    //設定範囲判定 と Vrms換算
                    if(mode == 1){
                        if(setval >= 50 && setval <= 138){
                            setval = setval * 0.12 * 0.196078;  //0.12:トランス比 0.196078:分圧抵抗比
                            //serial.printf("\r\n %f",setval);
                            setval /= 2;
                            setval /= sqrtf(2);
                            serial.printf("\r\n setval = %f",setval);
                            break;  //adjnumループ ブレイク
                        }
                        else{
                            serial.printf("\r\n\r\n NG!\r\n");
                            adjnum = 1;
                            break;  //adjnumループ ブレイク
                        }
                    }
                    else if(mode==2 || mode==3){
                        if(setval >= 10 && setval <= 120){
                            if(setval >= 61 && setval <= 120){SCT_AMP = 1; CTrange = 1;}
                            if(CTrange == 0){
                                setval = setval / 3000 * 10 * 5.666667;  //3000:CT比 10:終端抵抗 5.666667:分圧抵抗比
                            }
                            else if(CTrange == 1){
                                setval = setval / 3000 * 10 * 2.833333;  //3000:CT比 10:終端抵抗 2.833333:分圧抵抗比
                            }
                            serial.printf("\r\n setval = %f",setval);
                            break;  //adjnumループ ブレイク
                        }
                        else{
                            serial.printf("\r\n\r\n NG!\r\n");
                            adjnum = 1;
                            break;  //adjnumループ ブレイク
                        }
                    }
                } else count++;      // 文字カウンタに1加算
            } //if
        } //adjnumループ
        if(adjnum==0 || strcmp(moji,"q")==0){break;} //ループ1ブレイク
    } //ループ1

    int adjcount = 0; //ループ2上限変数
    
    while(1){ //ループ2
        if(strcmp(moji,"q")==0){
            serial.printf("\r\n quit");
            break; //ループ2ブレイク
        }
        else if(adjcount >= 15){    //ループ2上限値
            serial.printf("\r\n\r\n ERROR!\r\n");
            break; //ループ2ブレイク
        }
        
        ADVrms(mode);   //現在のVrms値
        
        diff = setval - Vrms;   //差分
        //serial.printf("\r\n diff = %f",diff);
        
        //増減方向判定
        if(diff > 0){incr = 1;} //増
        else if(diff < 0){
            incr = 0;           //減
            diff *= -1;         //絶対値
        }
        else if(diff == 0){break;}  //差分無し ループ2ブレイク
        serial.printf("\r\n diff = %f",diff);
        serial.printf("\r\n incr = %d",incr);


        //粗、微　読み取り
        ADDR(mode * 2);             //TRANS粗調整POT
        int read_val_Coarse = spi.write(0x0C00);
        read_val_Coarse &= 0x00FF;
    
        wait(0.001);
    
        ADDR(mode * 2 - 1);         //TRANS微調整POT
        int read_val_Fine = spi.write(0x0C00);
        read_val_Fine &= 0x00FF;
        
        //serial.printf("\r\n read_val_Coarse = %d",read_val_Coarse);
        //serial.printf("\r\n read_val_Fine = %d",read_val_Fine);


        if(mode == 1){
            //粗・微 調整判定
            float diffref_C = 0.000412 / 255 * read_val_Fine + 0.0032;
            float diffref_F = 0.000412 / 255 * read_val_Coarse + 0.000165;
            float diffcom = diffref_C * 1.5;
            //serial.printf("\r\n diffref_C = %f",diffref_C);
            //serial.printf("\r\n diffref_F = %f",diffref_F);
            //serial.printf("\r\n diffcom = %f",diffcom);
            if(diff >= diffcom){CorF = 2;} //粗
            else if(diff < diffcom){
                CorF = 1;               //微
                if(diff < 0.001){break;}//差分微小 ループ2ブレイク(通常最終ゴール)
            }
            serial.printf("\r\n CorF = %d",CorF);
        
