ryousato/LPC11U35_CTswitch_relay/main.cpp
            //調整tap値算出
            if(CorF == 2){val = diff / diffref_C;}
            else if(CorF == 1){val = diff / diffref_F;}
            serial.printf("\r\n tap(val) = %d",val);
        }
        else if(mode==2 || mode==3){
            if(CTrange == 0){   //60Aのとき
                //粗・微 調整判定
                float diffref_C = 0.001966 / 255 * read_val_Fine + 0.00885;
                float diffref_F = 0.001966 / 255 * read_val_Coarse + 0.000145;
                float diffcom = diffref_C * 1.5;
                serial.printf("\r\n diffref_C = %f",diffref_C);
                serial.printf("\r\n diffref_F = %f",diffref_F);
                serial.printf("\r\n diffcom = %f",diffcom);
                if(diff >= diffcom){CorF = 2;} //粗
                else if(diff < diffcom){
                    CorF = 1;               //微
                    if(diff < 0.002){break;}//差分微小 ループ2ブレイク(通常最終ゴール)
                }
                serial.printf("\r\n CorF = %d",CorF);
        
                //調整tap値算出
                if(CorF == 2){val = diff / diffref_C;}
                else if(CorF == 1){val = diff / diffref_F;}
                serial.printf("\r\n tap(val) = %d",val);
                }
            else if(CTrange == 1){  //120Aのとき
                //粗・微 調整判定
                float diffref_C = 0.000983 / 255 * read_val_Fine + 0.0044;
                float diffref_F = 0.000983 / 255 * read_val_Coarse + 0.0000993;
                float diffcom = diffref_C * 1.5;
                //serial.printf("\r\n diffref_C = %f",diffref_C);
                //serial.printf("\r\n diffref_F = %f",diffref_F);
                //serial.printf("\r\n diffcom = %f",diffcom);
                if(diff >= diffcom){CorF = 2;} //粗
                else if(diff < diffcom){
                    CorF = 1;               //微
                    if(diff < 0.002){break;}//差分微小 ループ2ブレイク(通常最終ゴール)
                }
                serial.printf("\r\n CorF = %d",CorF);
        
                //調整tap値算出
                if(CorF == 2){val = diff / diffref_C;}
                else if(CorF == 1){val = diff / diffref_F;}
                serial.printf("\r\n tap(val) = %d",val);
                }
        }
        //ワイパー位置移動
        incdec(incr, val, CorF, mode);
        
        adjcount ++;
         
    } //ループ2
    
    if(mode==1){coilEN2 = 1;}                                //TRANS_OUTを外部出力へ切替え
    else if(mode==2 || mode==3){coilEN3 = 1; coilEN4 = 0;}   //CT1_OUT1と2を外部出力へ切替え
    
    serial.printf("\r\n ADJ END");
}

void Vswitch(int a){
    coilEN5 = a;
    serial.printf("\r\n OK");
}
void Fswitch(int a){
    coilEN1 = a;
    serial.printf("\r\n OK");
}
void Tswitch(int a){
    coilEN2 = a;
    serial.printf("\r\n OK");
}
void Cswitch(int a,int b){
    coilEN3 = a;
    coilEN4 = b;
    serial.printf("\r\n OK");
}
void Rswitch(int a){
    SCT_AMP = a;
    CTrange = a;
    serial.printf("\r\n OK");
}

/******************************************************************************/
//シリアル入力受付 [メイン]
/******************************************************************************/
void serial_inout(){
    if(serial.readable()) {    // 受信確認
    moji[count] = serial.getc();        //キーボード入力文字を1文字ずつmojiに代入
    serial.printf("%c", moji[count]);   //シリアル出力表示
//    serial.printf("%c(%d)", moji[count],count);   //シリアル出力表示
        
        if(count == 31 ){                // ①文字数が既定の個数になった場合
        moji[31] = '\0';                 // 末尾に終端文字を入れる
        count = 0;                       // 文字カウンタをリセット
        serial.printf("\r\n\r\n ERROR!");
        }

        else if(moji[0] == '\n'){count = 0;}
    
        else if((moji[count] == '\r')) {       // ②CRを受信した場合
            moji[count] = '\0';                                                     //末尾に終端文字を入れる
            count = 0;                                                              //文字カウンタをリセット
            if     (strcmp(moji, "cmd") == 0){helpwrite();}                         //コマンド一覧表示
            else if(strcmp(moji, "help") == 0){helpwrite();}                        //コマンド一覧表示
            else if(strcmp(moji, "?") == 0){helpwrite();}                           //コマンド一覧表示
            else if(strcmp(moji, "initial") == 0){initial();}                       //初期化
            
            else if(strcmp(moji, "V_OFF") == 0){Vswitch(0);}                        //±5V,±15Vオフ
            else if(strcmp(moji, "V_ON") == 0){Vswitch(1);}                         //±5V,±15Vオン
            else if(strcmp(moji, "50Hz") == 0){Fswitch(0);}                         //周波数切替
            else if(strcmp(moji, "60Hz") == 0){Fswitch(1);}                         //周波数切替
            else if(strcmp(moji, "TRANS_OUT_ADINT") == 0){Tswitch(0);}              //TRANS_OUT内部AD入力
            else if(strcmp(moji, "TRANS_OUT_EXT") == 0){Tswitch(1);}                //TRANS_OUT外部出力
            else if(strcmp(moji, "CT1_OUT_ADINT") == 0){Cswitch(0,0);}              //CT1_OUT内部AD入力
            else if(strcmp(moji, "CT2_OUT_ADINT") == 0){Cswitch(0,1);}              //CT2_OUT内部AD入力
            else if(strcmp(moji, "CT_OUT_EXT") == 0){Cswitch(1,0);}                 //CT1,2_OUT外部出力
            else if(strcmp(moji, "CTrange_60A") == 0){Rswitch(0);}                  //CT入力アンプゲイン60A    
            else if(strcmp(moji, "CTrange_120A") == 0){Rswitch(0);}                 //CT入力アンプゲイン120A    
            
            else if(strcmp(moji, "TRANS_offset") == 0){offsetcal(1);}               //TRANS_OUT ADオフセット補正
            else if(strcmp(moji, "CT_offset") == 0){offsetcal(2);}                  //CT_OUT ADオフセット補正
//            else if(strcmp(moji, "CT2_offset") == 0){offsetcal(3);}                 //CT2_OUT ADオフセット補正
            else if(strcmp(moji, "dispVref") == 0){dispVref();}                     //各Vref表示
            else if(strcmp(moji, "TRANS_ADJ_100V") == 0){auto_adj(1,100);}          //TRANS_OUTを設定
            else if(strcmp(moji, "CT1_ADJ_60A") == 0){auto_adj(2,60);}              //CT1を設定
            else if(strcmp(moji, "CT2_ADJ_60A") == 0){auto_adj(3,60);}              //CT2を設定
            else if(strcmp(moji, "TRANS_ADJ_MODE") == 0){auto_adj_mode(1);}         //TRANS_OUT調整モードに移行
            else if(strcmp(moji, "CT1_ADJ_MODE") == 0){auto_adj_mode(2);}           //CT1_OUT調整モードに移行
            else if(strcmp(moji, "CT2_ADJ_MODE") == 0){auto_adj_mode(3);}           //CT2_OUT調整モードに移行
            else if(strcmp(moji, "MANUAL_TRANS_ADJ") == 0){manual_adj(1);}          //TRANS_OUT手動調整モードに移行
            else if(strcmp(moji, "MANUAL_CT1_ADJ") == 0){manual_adj(2);}            //CT1_OUT手動調整モードに移行
            else if(strcmp(moji, "MANUAL_CT2_ADJ") == 0){manual_adj(3);}            //CT1_OU2手動調整モードに移行
            
