ryousato/LPC11U35_CTswitch_relay/main.cpp
            //デバッグ用
            else if(strcmp(moji, "TCON") == 0){TCON();}
            else if(strcmp(moji, "TCONread") == 0){TCONread();}
            else if(strcmp(moji, "read") == 0){read();}
            else if(strcmp(moji, "write00") == 0){write00();}
            else if(strcmp(moji, "write7F") == 0){write7F();}
            else if(strcmp(moji, "writeFF") == 0){writeFF();}
            else if(strcmp(moji, "WLAT") == 0){WLAT();}
            else if(strcmp(moji, "CS0") == 0){CS(0);}
            else if(strcmp(moji, "CS1") == 0){CS(1);}
            else if(strcmp(moji, "AD1") == 0){AD(1);}
            else if(strcmp(moji, "AD2") == 0){AD(2);}
            else if(strcmp(moji, "TENinc") == 0){TENinc();}
            else if(strcmp(moji, "att1") == 0){att(1);}
            else if(strcmp(moji, "att2") == 0){att(2);}
            else if(strcmp(moji, "att3") == 0){att(3);}
            else if(strcmp(moji, "det") == 0){det();}
            else if(strcmp(moji, "AD1_Vrms") == 0){ADVrms(1);}
            else if(strcmp(moji, "AD2_Vrms") == 0){ADVrms(2);}
            else if(strcmp(moji, "AD3_Vrms") == 0){ADVrms(3);}
            else if(strcmp(moji, "ADDR1") == 0){ADDR(1);}
            else if(strcmp(moji, "ADDR2") == 0){ADDR(2);}
            else if(strcmp(moji, "ADDR3") == 0){ADDR(3);}
            else if(strcmp(moji, "ADDR4") == 0){ADDR(4);}
            else if(strcmp(moji, "ADDR5") == 0){ADDR(5);}
            else if(strcmp(moji, "ADDR6") == 0){ADDR(6);}
            
                   
            else serial.printf("\r\n\r\n NG!\r\n");
        }
        else count++;        // 文字カウンタに1加算
    }
}    

/******************************************************************************/
//メインプログラム
/******************************************************************************/
int main() {
    pAVrefcal = &ActualVref[0];
    pmode = &mode_p;
    pCTrange = &CTrange;
        
    led1 = 1;
    wait(0.2);
    setup();
    initial();
    offsetcal(1);
    offsetcal(2);
//    offsetcal(3);
    auto_adj(1,100);
    auto_adj(2,60);
    auto_adj(3,60);
    coilEN2 = 1;    //TRANS_OUT出力
    coilEN3 = 1;    //CT1,2_OUT出力
    coilEN4 = 0;
    led1 = 0;
    serialstart();
    
//*(volatile int *)0x4004402C = 0x2;  //  (レジスタ値を直接入力) アドレス0x4004402Cに値を代入
//*(volatile int *)0x4004402C;
//serial.printf( "data in 0x4004402C is 0x%08X\n", *(volatile int *)0x4004402C );  //  アドレス0x4004402Cの値を表示
  
    while(1){
        serial_inout();
    }
  

}